<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ParentRecipe</key>
    <string>io.github.hjuutilainen.download.TeamViewerHost</string>
	<key>Description</key>
	<string>Downloads the latest version of Wireshark and builds a pkg.</string>
	<key>Identifier</key>
	<string>com.github.peertransfer.pkg.TeamViewerHost</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%/*.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
    </array>
</dict>
</plist>